<a href="https://colab.research.google.com/github/SangeerthanaBalasubramaniam/Data-Science/blob/main/Missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

**Import and read**

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/dayanandv/Data-Science/main/dataset/property%20data.csv') #use raw and fetch the link from github
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

Analysis from dataset:

NAN-Not A Number. Pid should be number but there is no value for one row. ST_NUM also has NAN.

OWN_OCCUPIED has values 12 and NAN in addition to Y or N. It is supposed to be bool and 12 numeric shouldn't be there.

NUM_BEDROOMS has float value which seems to be illogical and also na value.

In [3]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

**Check for null values**

Check whether the column has null value or not

In [4]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [5]:
df['SQ_FT'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

isnull() finds only null values. "--" will not be identified. converting "--" to proper missing value like NAN is called preprocessing.

In [6]:
missing_values = ['na','--','NA','n/a','-']
df = pd.read_csv('https://raw.githubusercontent.com/dayanandv/Data-Science/main/dataset/property%20data.csv', na_values = missing_values) # replacing non-standard value to standard format during preprocessing
df
# row 2 , col 7 has been replaced. row 9 , col 5 has also been replaced.

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

**Replace wrong category of data in columns**

OWN_OCCUPIED expects only bool but we have an integer value in one of the rows. So does NUM_BATH with string should be replaced to NAN.

In [7]:
import numpy as np
# Using regular expressions to match and replace numbers/strings in columns where they are not expected.
df['OWN_OCCUPIED'] = df['OWN_OCCUPIED'].replace(r'[0-9]+', np.nan, regex = True) # replace[0-9] to np.nan, "r" denotes regex.
df['NUM_BATH'] = df['NUM_BATH'].replace(r'[A-Za-z]+', np.nan, regex = True)
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

**Summary stats of missing data**

Number of null values per column

In [8]:
df.isnull().sum() #sum or gives a count of all missing data in each column in dataset.

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64

Total number of null values in the dataframe

In [9]:
df.isnull().sum().sum()

12

**Replacing missing values in the whole dataframe -> Imputation **


Backfill

In [10]:
df.fillna(method = 'bfill') # bfill -> Fills the nan value using values from next row.

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   850.0
2  100003000.0   201.0   LEXINGTON            N           1.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0        2   700.0
4  100006000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0        1   800.0
6  100007000.0   213.0  WASHINGTON            Y           2.0        1   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1800.0
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

Disadvantage in Bfills: If a column in last row has NAN value, it will not bee replace since there will be no next row to take value from.

Fill with a custom value

In [11]:
df.fillna('abcd')

           PID ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  1.00001e+08    104      PUTNAM            Y            3        1  1000
1  1.00002e+08    197   LEXINGTON            N            3      1.5  abcd
2  1.00003e+08   abcd   LEXINGTON            N         abcd        1   850
3  1.00004e+08    201    BERKELEY         abcd            1     abcd   700
4         abcd    203    BERKELEY            Y            3        2  1600
5  1.00006e+08    207    BERKELEY            Y         abcd        1   800
6  1.00007e+08   abcd  WASHINGTON         abcd            2     abcd   950
7  1.00008e+08    213     TREMONT            Y            1        1  abcd
8  1.00009e+08    215     TREMONT            Y         abcd        2  1800

Disadvatage of custom value: It can change the values.

**Dropping NaN values**

In [12]:
df.dropna() # returns the rows which has no NAN value in any column. Every row has one or other nan value except 0th row.

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [13]:
df.dropna(how='all') # Drop row only when all entries in the row are NAN.

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

**Imputation using sklearn SimpleImputer**

Strategy argument can take the values – ‘mean'(default), ‘median’, ‘most_frequent’ and ‘constant’

In [14]:
from sklearn.impute import SimpleImputer 
dataset = pd.read_csv('https://raw.githubusercontent.com/dayanandv/Data-Science/main/dataset/pima-indians-diabetes.csv', skiprows=1, header=None)
dataset

      0    1   2   3    4     5      6   7  8
0     6  148  72  35    0  33.6  0.627  50  1
1     1   85  66  29    0  26.6  0.351  31  0
2     8  183  64   0    0  23.3  0.672  32  1
3     1   89  66  23   94  28.1  0.167  21  0
4     0  137  40  35  168  43.1  2.288  33  1
..   ..  ...  ..  ..  ...   ...    ...  .. ..
763  10  101  76  48  180  32.9  0.171  63  0
764   2  122  70  27    0  36.8  0.340  27  0
765   5  121  72  23  112  26.2  0.245  30  0
766   1  126  60   0    0  30.1  0.349  47  1
767   1   93  70  31    0  30.4  0.315  23  0

[768 rows x 9 columns]

In [16]:
dataset.isnull().sum().sum() # no NAN values in the sample dataset.

0

Replace all '0's in the first five columns with nan

In [17]:
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan) # dataset[[1,2,3,4,5]] -> column index is specified. 
dataset

      0      1     2     3      4     5      6   7  8
0     6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1     1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2     8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3     1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4     0  137.0  40.0  35.0  168.0  43.1  2.288  33  1
..   ..    ...   ...   ...    ...   ...    ...  .. ..
763  10  101.0  76.0  48.0  180.0  32.9  0.171  63  0
764   2  122.0  70.0  27.0    NaN  36.8  0.340  27  0
765   5  121.0  72.0  23.0  112.0  26.2  0.245  30  0
766   1  126.0  60.0   NaN    NaN  30.1  0.349  47  1
767   1   93.0  70.0  31.0    NaN  30.4  0.315  23  0

[768 rows x 9 columns]

In [18]:
values = dataset.values 
values #creates list of list

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])


Replace all nan with column's mean

Rather than replacing missing values with bfill, ffill or any other method, it would be better to replace with mean of all values. strategy parameter will be used for this.

Default value of strategy is mean.

In [19]:
imputer = SimpleImputer(missing_values=np.nan, strategy='mean') 
transformed_values = imputer.fit_transform(values) # take the list of list array and replace nan values.
transformed_values

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])

In [20]:
# Converting back the array containing list of list to dataframe by passing the array containing list of list.
dataset_transformed = pd.DataFrame(transformed_values)
dataset_transformed

        0      1     2         3           4     5      6     7    8
0     6.0  148.0  72.0  35.00000  155.548223  33.6  0.627  50.0  1.0
1     1.0   85.0  66.0  29.00000  155.548223  26.6  0.351  31.0  0.0
2     8.0  183.0  64.0  29.15342  155.548223  23.3  0.672  32.0  1.0
3     1.0   89.0  66.0  23.00000   94.000000  28.1  0.167  21.0  0.0
4     0.0  137.0  40.0  35.00000  168.000000  43.1  2.288  33.0  1.0
..    ...    ...   ...       ...         ...   ...    ...   ...  ...
763  10.0  101.0  76.0  48.00000  180.000000  32.9  0.171  63.0  0.0
764   2.0  122.0  70.0  27.00000  155.548223  36.8  0.340  27.0  0.0
765   5.0  121.0  72.0  23.00000  112.000000  26.2  0.245  30.0  0.0
766   1.0  126.0  60.0  29.15342  155.548223  30.1  0.349  47.0  1.0
767   1.0   93.0  70.0  31.00000  155.548223  30.4  0.315  23.0  0.0

[768 rows x 9 columns]

In [21]:
dataset_transformed.isnull().sum().sum() # returns 0 since the NAN values are replaced by mean of that column.

0